SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииЗначений/ПравилаКонвертацииЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииЗначений</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПравилаКонвертацииОбъектов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Значения</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Значения</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииЗначений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		ЗначениеИсточник = Строка(Источник);
		ЗначениеПриемник = Строка(Приемник);
		
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СМП_ОбщегоНазначения.глНаименованиеПКЗ(ЭтотОбъект);
	КонецЕсли;

	Если Порядок = 0 Тогда
		Порядок = СМП_ОбщегоНазначения.ОчереднойПорядок("ПравилаКонвертацииЗначений", Родитель, Владелец);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьУникальныйКод() Экспорт
	УстановитьНовыйКод();
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';uk='Неприпустимий виклик об`єкту на клієнті.'");
#КонецЕсли
